[{
    "name": "Ashley Canady",
    "image": "https://dha-vs-everybody.s3.us-east-2.amazonaws.com/ashley-square.png",
    "text": "I’m Ashley Canady, and my address is [address omitted], and if you’re supporting McDougald, stand up! I have everybody here with me. A lot of these people are coming from McDougald. I’m coming from McDougald Terrace, and I’m here today because our community is suffering. We have a lot of our loved ones that are displaced. This week has been very hectic. I got back in town right before New Years and I know I put at least 233 hours or more in McDougald Terrace, and I don’t get paid. That’s people that are doing the job — the job that I’m doing, are getting paid. Day in and day out. Some days, I leave at 1:00 in the morning. I’m a single mother of four kids. Something’s got to give. Something’s got to give for our community. We’re out here tonight asking the city, the county, whoever it may be to come out to McDougald and help us. I’ve been receiving donations all day. All day long. And our volunteers have worked all day long. All weekend. Feeding thousands of people. Today was my first decent meal in almost a week. I’m running off of four hours of sleep. I have a headache right now. But I’m here with my residents. So I just want the city and everybody else to figure out what we can do to get our loved ones home in a safe and clean environment. Because guess what? Y’all wouldn’t want to live there. Nobody would want their kids living in these conditions right now. How would y’all feel if one of y’all woke up in the morning and one of your babies wasn’t living? I have so many parents telling me that they stand up watching their kids sleep just to make sure they’re not taking their last breath. Come on y’all, something has got to give."
    },
    {
    "name": "Samantha Crowder",
    "image": "https://dha-vs-everybody.s3.us-east-2.amazonaws.com/ashley-square.png",
    "text": "Hi, good evening. Samantha Crowder. [address omitted]. My question is, to the City of Durham, have you ever had to look in your baby’s eyes and fear death because of the conditions of your living situation? When your rent is paid, and you’ve been a resident at this place for four years. You’ve got bubbles in your ceiling, just terrible conditions. Mold in the bathroom that I can’t fight. They glazed the tub with paint so it stops up. Clogs the whole drain. It’s like you’re taking a shower in a river or something. It’s inhumane, absolutely ridiculous. You call in for a work order, it takes months, weeks to get some help. You have to constantly call to get something as simple as a tub unclogged. The way the buildings are set up, if one toilet or one tub is backed up, the entire building is backed up. Have you ever flushed your toilet and your feces comes up in your tub? That’s what we deal with in McDougald on the regular. That’s no lie. This is what I had my baby breathing in. She will be six months on the 29th. She came home into those conditions. I got in connection with Durham connection, they came out and tested my unit, I have proof. THERE’S lead based paint there. She will be moving around soon. Every day, I look in her eyes in fear, because of my living conditions I don’t know what could possibly happen. And really there’s nothing I can do about it right now other than stand up and say what I experienced living in McDougald Terrance. It’s the honest god truth. Please, you guys, help us, please. I’m displaced. I have five children. I have to get one child to KIPP Durham, another son to Dps elementary, my oldest daughter to Hillside high school. I don’t have a vehicle. I can’t go outside and put them on the bus from the Days Inn hotel. It’s frustrating. I don’t know where our next meal is coming from. I appreciate all the resources that everybody’s helping — thank you so much, Ashley — but this is really stressful. On another level of being stressful. I never thought that it would come to this. And I don’t see them actually fixing the issues that we have. It’s unfixable. If each and every one of you guys were to come in just my one apartment for an hour, I ain’t even gonna give you six months, in an hour you’ll be ready to go. Five minutes, you’ll be ready to go!"
    }]